Simulations/Tests/1Turbina/1.6MMnodos/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    outlet
    {
        type            patch;
        nFaces          6400;
        startFace       4753600;
    }
    sides
    {
        type            patch;
        nFaces          40000;
        startFace       4760000;
    }
    inlet
    {
        type            patch;
        nFaces          6400;
        startFace       4800000;
    }
    ground
    {
        type            wall;
        inGroups        1(wall);
        nFaces          20000;
        startFace       4806400;
    }
    top
    {
        type            patch;
        nFaces          20000;
        startFace       4826400;
    }
)

// ************************************************************************* //
