Simulations/Tests/1Turbina/1.6MMnodos/constant/airfoilProperties/S809_RE550
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      airfoilProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

airfoilData
(
//   alpha   C_l    C_d
    (	-0.3	0.151	0.002	)
(	1.8	0.354	0.001	)
(	3.8	0.561	0.002	)
(	5.9	0.765	0.006	)
(	7.9	0.86	0.015	)
(	10.0	0.848	0.031	)
(	11.0	0.892	0.043	)
(	12.0	0.888	0.049	)
(	13.0	0.927	0.043	)
(	14.0	0.91	0.075	)
(	15.0	0.91	0.075	)
(	16.0	0.928	0.107	)
(	17.0	0.686	0.278	)
(	18.0	0.639	0.276	)
(	19.0	0.576	0.273	)
(	20.0	0.552	0.275	)
(	22.0	0.596	0.323	)
(	23.9	0.649	0.37	)
(	26.0	0.68	0.417	)
(	30.0	0.851	0.576	)
(	35.0	1.01	0.789	)
(	40.0	1.12	1.03	)
(	45.0	1.12	1.19	)
(	50.0	1.1	1.36	)
(	55.3	1.08	1.58	)
(	60.2	0.931	1.62	)
(	65.2	0.968	2	)
(	70.2	0.776	2.04	)
(	75.2	0.63	2.13	)
(	80.2	0.485	2.32	)
(	85.1	0.289	2.14	)
(	90.2	0.109	2.27	)

);
